# RailingNotConnectedError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..RailingNotConnectedError Property
BuiltInFailures..::..SketchFailures Class See Also
---
The Railing line must be a single connected Sketch. If you want separate pieces of Railing, create two or more separate Railings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RailingNotConnectedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingNotConnectedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RailingNotConnectedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace